Repository: inrae/ALAMODE-okp
Catalog: sphinx-doc/tm/okplm-level2.tmx
Source language: en_gb
Languages: fr_fr

source: Presentation
fr_fr: Présentation

source: Project-Id-Version: okplm Report-Msgid-Bugs-To: POT-Creation-Date: 2020-01-27 15:04+0100 PO-Revision-Date: YEAR-MO-DA HO:MI+ZONE Last-Translator: FULL NAME <EMAIL@ADDRESS> Language-Team: LANGUAGE <LL@li.org> MIME-Version: 1.0 Content-Type: text/plain; charset=utf-8 Content-Transfer-Encoding: 8bit Generated-By: Babel 2.8.0
fr_fr: Project-Id-Version: okplm Report-Msgid-Bugs-To: POT-Creation-Date: 2020-01-27 15:04+0100 PO-Revision-Date: YEAR-MO-DA HO:MI+ZONE Last-Translator: FULL NAME <EMAIL@ADDRESS> Language-Team: LANGUAGE <LL@li.org> MIME-Version: 1.0 Content-Type: text/plain; charset=utf-8 Content-Transfer-Encoding: 8bit Generated-By: Babel 2.7.0

source: Project-Id-Version: okplm Report-Msgid-Bugs-To: POT-Creation-Date: 2022-07-06 19:56+0200 PO-Revision-Date: YEAR-MO-DA HO:MI+ZONE Last-Translator: FULL NAME <EMAIL@ADDRESS> Language-Team: LANGUAGE <LL@li.org> MIME-Version: 1.0 Content-Type: text/plain; charset=utf-8 Content-Transfer-Encoding: 8bit Generated-By: Babel 2.9.1
fr_fr: Project-Id-Version: okplm Report-Msgid-Bugs-To: POT-Creation-Date: 2022-07-06 19:56+0200 PO-Revision-Date: YEAR-MO-DA HO:MI+ZONE Last-Translator: FULL NAME <EMAIL@ADDRESS> Language-Team: LANGUAGE <LL@li.org> MIME-Version: 1.0 Content-Type: text/plain; charset=utf-8 Content-Transfer-Encoding: 8bit Generated-By: Babel 2.7.0

source: Providing either ``lake_file`` or ``par_file`` is necessary.
fr_fr: Il est nécessaire de fournir soit ``lake_file`` soit ``par_file``.

source: Python code
fr_fr: Code Python

source: Python module
fr_fr: Module Python

source: Read lake or parameter file to dictionary.
fr_fr: Lit fichier de lac ou de paramètres et stocke dans un dictionnaire.

source: References
fr_fr: Références

source: Remember you may use the tilde '~' expansion.
fr_fr: À nouveau, vous pouvez utiliser le tilde '~'.

source: Requirements and dependencies
fr_fr: Besoins et dépendances

source: Return indices of dates comprised between two dates.
fr_fr: Retourne les indices des dates comprises entre deux dates.

source: Returns
fr_fr: Retour

source: Run the OKP model.
fr_fr: Exécute le modèle OKP.

source: Similarly, the results are written by default to ``output.txt``, but you can use define another name using ``-o``.
fr_fr: De façon similaire, les résultats sont écrit par défaut dans ``output.txt``, mais vous pouvez définir un autre nom avec ``-o``.

source: Some help documents have been written using markdown (README.md, package_description.md).
fr_fr: Quelques documents d'aide ont été écrits en format markdown (README.md, package_description.md).

source: Sphinx also extracts data from the project modules docstrings.
fr_fr: Sphinx extrait aussi des données des docstrings des modules du projet.

source: Start and end of simulation
fr_fr: Début et fin de la simulation

source: The OKP model is the result of the combination of the models presented by Ottosson & Abrahamsson (1998) and Kettle *et al.* (2004).
fr_fr: Le modèle OKP est le résultat de la combinaison des modèles présentés par Ottosson & Abrahamsson (1998) et Kettle *et al.* (2004).

source: The OKP model produces three types of output data:
fr_fr: Le modèle OKP produit trois types de données de sortie :

source: The OKP model simulates water temperature at the daily frequency using air temperature [in ºC] and solar radiation [in W m\ :sup:`2`\ ] as forcing data.
fr_fr: Le modèle OKP simule la température de l'eau à fréquence journalière utilisant la température de l'air [en ºC] et le rayonnement solaire [en W m\ :sup:`2`\ ] comme données d'entrée.

source: The ``okplm`` package is originally written in English and translated into French.
fr_fr: Le package ``okplm`` a été écrit originalement en anglais et traduit en français.

source: The address may vary depending on whether you install it for one or all users (e.g., ``%USERPROFILE%\AppData\roaming\Python\Python37\scripts`` or ``C:\Users\MyUserName\AppData\Local\Programs\Python\Python37\Scripts``).
fr_fr: L'adresse peut varier selon le cas, si vous l'installez pour un ou tous les utilisateurs (e.g., ``%USERPROFILE%\AppData\roaming\Python\Python37\scripts`` ou ``C:\Users\MyUserName\AppData\Local\Programs\Python\Python37\Scripts``).

source: The application ``okplm`` depends on the Python package ``numpy``.
fr_fr: L'application ``okplm`` dépend du package Python ``numpy``.

source: The constants are defined in Prats & Danis (2019).
fr_fr: Les constantes sont définies dans Prats & Danis (2019).

source: The daily simulated epilimnion temperature in degrees C.
fr_fr: La température simulée de l'épilimnion en dégrées C.

source: The daily simulated hypolimnion temperature in ºC.
fr_fr: La température simulée de l'hypolimnion en ºC.

source: The data
fr_fr: Les données

source: The data are in the folder:
fr_fr: Les données sont dans le dossier :

source: The date indicates the beginning of each month.
fr_fr: La date indique le début de chaque mois.

source: The date indicates the beginning of each week.
fr_fr: La date indique le début de chaque semaine.

source: The definitive version was published by Prats & Danis (2019).
fr_fr: La version définitive a été publiée par Prats & Danis (2019).

source: The development of the model was funded by the AFB (French Agency for Biodiversity, previously ONEMA, French National Office for Water and Aquatic Environments) and a preliminary version was presented in the report by Prats & Danis (2015).
fr_fr: Le développement du modèle a été financé par l'AFB (Agence Française pour la Biodiversité, antérieurement ONEMA, Office National de l'Eau et des Milieux Aquatiques) et une version préliminaire a été présentée dans le rapport par Prats & Danis (2015).

source: The documentation in French is saved in the folder ``build_fr``.
fr_fr: La documentation en français est sauvegardée dans le dossier ``build_fr``.

source: The documentation translated into French has been created using ``sphinx-intl``.
fr_fr: La documentation traduite en français a été créé avec ``sphinx-intl``.

source: The estimated value of the parameter *A* according to Eq.
fr_fr: La valeur estimée du paramètre *A* d'après l'Éq.

source: The estimated value of the parameter *B* according to Eq.
fr_fr: La valeur estimée du paramètre *B* d'après l'Éq.

source: The estimated value of the parameter *C* according to Eq.
fr_fr: La valeur estimée du paramètre *C* d'après l'Éq.

source: The estimated value of the parameter *E* according to Eq.
fr_fr: La valeur estimée du paramètre *E* d'après l'Éq.

source: The estimated value of the parameter :math:`\alpha` according to Eq.
fr_fr: La valeur estimée du paramètre :math:`\alpha` d'après l'Éq.

source: The estimated value of the parameter :math:`\beta` according to Eq.
fr_fr: La valeur estimée du paramètre :math:`\beta` d'après l'Éq.

source: The file ``lake.txt`` is not necessary.
fr_fr: Le fichier ``lake.txt`` n'est pas nécessaire.

source: The file contains data for the dates for which measurements are available.
fr_fr: Le fichier contient données pour les dates où il y a des mesures disponibles.

source: The file is structured in (at most) three columns separated by white spaces:
fr_fr: Le fichier est organisé en (au maximum) trois colonnes séparées par espaces vides :

source: The file is structured in six columns separated by white spaces:
fr_fr: Le fichier est organisé en six colonnes séparées par espaces vides :

source: The file is structured in three columns separated by white spaces:
fr_fr: Le fichier est organisé en trois colonnes séparées par espaces vides :

source: The file is structured in two columns, separated by blanks.
fr_fr: Le fichier est organisé en deux colonnes, séparées par espaces.

source: The file should be structured in two columns separated by a space; the first column contains key names and the second column contains their values.
fr_fr: Le fichier devrait être organisé en deux colonnes séparées par un espace ; la première colonne contient les noms des clés et la deuxième colonne contient ses valeurs.

source: The first column contains the names of the parameters and the second one contains their values.
fr_fr: La première colonne contient les noms des paramètres et la deuxième contient leurs valeurs.

source: The first column contains the names of the variables and the second one contains their values.
fr_fr: La première colonne contient les noms des variables et la deuxième contient leurs valeurs.

source: The first line of results corresponds to the epilimnion, and the second line of results corresponds to the hypolimnion.
fr_fr: La première ligne des résultats correspond à l'épilimnion, et la deuxième ligne des résultats correspond à l'hypolimnion.

source: The folder ``tests`` contains 2 scripts to test the functionalities of the package `okplm`:
fr_fr: Le dossier ``tests`` contient 2 scripts permettant de tester les fonctionnalités du paquet ``okplm`` :

source: The following table summarises the range of values of the characteristics of these water bodies and thus the domain of applicability of the default parameterisation.
fr_fr: La table suivante résume les caractéristiques de ces plans d'eau et définit les rangs espérés d'applicabilité de la paramétrisation par défaut.

source: The format of the dates is 'yyyy-mm-dd'.
fr_fr: Le format des dates est 'aaaa-mm-jj'.

source: The functions in this module are used to read the configuration and input data files of the OKP lake model, as well as for writing the results to a text file.
fr_fr: Les fonctions de ce module servent à lire les fichiers de configuration et d'entrée du modèle de lacs OKP, ainsi qu'à écrire les résultats dans un fichier texte.

source: The functions included in this module are:
fr_fr: Les fonctions incluses dans ce module sont :

source: The included functions are:
fr_fr: Les fonctions incluses sont :

source: The installation process is as above:
fr_fr: Le procès d'installation est comme ci-dessus :

source: The meteorological data (``meteo.txt``) is synthetic data based on meteorological data.
fr_fr: Les données météorologiques (``meteo.txt``) sont des données synthétiques d'une base de données météorologiques.

source: The model reads input and configuration data from three text files, one obligatory (``meteo_file``) and two optional (``lake_file`` and ``par_file``).
fr_fr: Le modèle lit les données d'entrée et de configuration depuis trois fichiers texte, un obligatoire (``meteo_file``) et deux optionnels (``lake_file`` et ``par_file``).

source: The model uses the given parameter values (``par.txt``) and the daily meteorological data (``meteo.txt``).
fr_fr: Le modèle utilise donc les valeurs de paramètre (``par.txt``) et les données météorologiques journalières (``meteo.txt``).

source: The necessary data for these tests can be found in the folders:
fr_fr: Les données nécessaires pour ces trois tests sont dans les dossiers :

source: The output html files are saved in the folder ``pathtorepertoryokplm/sphinx-doc/build/html``
fr_fr: Les fichiers html de sortie sont stockés dans le dossier ``pathtorepertoryokplm/sphinx-doc/build/html``.

source: The output html files are saved in the folder ``pathtorepertoryokplm/sphinx-doc/build_fr/html``.
fr_fr: Les fichiers html de sortie sont stockés dans le dossier ``pathtorepertoryokplm/sphinx-doc/build_fr/html``.

source: The output latex and pdf files are saved in the folder ``pathtorepertoryokplm/sphinx-doc/build/latex``.
fr_fr: Les fichiers latex et pdf de sortie sont stockés dans le dossier ``pathtorepertoryokplm/sphinx-doc/build/latex``.

source: The output latex and pdf files are saved in the folder ``pathtorepertoryokplm/sphinx-doc/build_fr/latex``.
fr_fr: Les fichiers latex et pdf de sortie sont sauvegardés dans le dossier ``pathtorepertoryokplm/sphinx-doc/build_fr/latex``.

source: The output of daily simulations can be given at ``daily``, ``weekly`` or ``monthly`` frequency using the argument ``output_periodicity``.
fr_fr: La sortie des simulations journalières peut être donnée à fréquence journalière (``daily``), hebdomadaire (``weekly``) ou mensuelle (``monthly``) avec l'argument ``output_periodicity``.

source: The package ``sphinx`` works by default with reStructuredText documents.
fr_fr: Le paquet ``sphinx`` travaille par défaut avec documents de type reStructuredText.

source: The package contains four data examples in the folder ``examples``.
fr_fr: Le paquet contient quatre jeux de données d'exemple dans les dossier ``examples``:

source: The pairs of names-values may be specified in any order.
fr_fr: Les paires de noms-valeurs peuvent être spécifiés dans n'importe quel ordre.

source: The parameter names are:
fr_fr: Les noms des paramètres sont :

source: The po files contain pairs of segments of text in the source (msgid) and target language (msgstr).
fr_fr: Les fichiers po contiennent paires de segments de texte dans les langues source (msgid) et cible (msgstr).

source: The remaining test case (synthetic_case_par_given) exemplifies the case when the parameter file is given.
fr_fr: Le dernier cas de test (``synthetic_case_par_given``) est le cas où un fichier utilisateur des paramètres du modèle est donné en entrée.

source: The resulting po files are stored in the folder ``source/locale/fr/LC_MESSAGES``.
fr_fr: Les fichiers po créés sont stockés dans le dossier ``source/locale/fr/LC_MESSAGES``.

source: The resulting pot files are saved in the folder ``build/gettext``.
fr_fr: Les fichiers pot créés sont stockés dans le dossier ``build/gettext``.

source: The results are then presented as an html file such as:
fr_fr: Les résultats sont alors présentés sous la forme d'un fichier html de ce type :

source: The sequence t_day is a datetime sequence at daily frequency.
fr_fr: La séquence t_day est une séquence de type datetime à fréquence journalière.

source: The sequence t_mon is a datetime sequence at monthly frequency.
fr_fr: La séquence t_mon est une séquence de type datetime à fréquence hebdomadaire.

source: The sequence t_week is a datetime sequence at weekly frequency.
fr_fr: La séquence t_week est une séquence de type datetime à fréquence hebdomadaire.

source: The sequence y_day is the output data sequence, result of applying funcname to the x values for each day.
fr_fr: La séquence y_day est la séquence des données de sortie, résultat de l'application de funcname aux valeurs x pour chaque jour.

source: The sequence y_mon is the output data sequence, result of applying funcname to the x values for each month.
fr_fr: La séquence y_mon est la séquence des données de sortie, résultat de l'application de funcname aux valeurs x pour chaque mois.

source: The sequence y_week is the output data sequence, result of applying funcname to the x values for each week.
fr_fr: La séquence y_week est la séquence des données de sortie, résultat de l'application de funcname aux valeurs x pour chaque semaine.

source: The simulations
fr_fr: Les simulations

source: The source documentation files are converted to latex and then to pdf.
fr_fr: Les fichiers source de la documentation sont convertis à latex et après à pdf.

source: The source files for the project user manual are stored in the folder ``pathtorepertoryokplm/sphinx-doc/source``.
fr_fr: Les fichiers source du manuel d'utilisation du projet sont stockés dans le dossier ``pathtorepertoryokplm/sphinx-doc/source``.

source: The translation instructions are based on https://sphinx-doc.org/en/1.8/intl.html.
fr_fr: Les instructions de traduction sont basées sur https://sphinx-doc.org/en/1.8/intl.html.

source: The translation of the documentation files is based on the extraction of the translatable text into pot (portable object template) files and the creation of translated text in po (portable object) files.
fr_fr: La traduction des fichiers de documentation est basé sur l'extraction du texte traduisible en fichiers pot (portable object template) et la création de texte traduit en fichiers po (portable object).

source: The user manual has been generated using ``sphinx`` from files using `reStructuredText <http://www.sphinx-doc.org/en/master/usage/restructuredtext/index.html>`_ markup language.
fr_fr: Le manuel d'utilisation a été généré avec ``sphinx`` depuis fichiers en format markup `reStructuredText <http://www.sphinx-doc.org/en/master/usage/restructuredtext/index.html>`_ .

source: The values of the parameters thus estimated are written to ``par_file``.
fr_fr: Les valeurs des paramètres ainsi estimés sont écrits dans ``par_file``.

source: The variable names are:
fr_fr: Le noms des variables sont :

source: The water density (kg/m\ :sup:`3`\ ) calculated using the formula by Markofsky & Harleman (1971).
fr_fr: La densité de l'eau (kg/m\ :sup:`3`\ ) est calculée avec la formule de Markofsky & Harleman (1971).

source: Then you need to generate the po files for each target language.
fr_fr: Alors vous devez générer les fichiers po pour chaque langue cible.

source: Then, type::
fr_fr: Après, tapez::

source: Then, you only need to translate the modified segments.
fr_fr: Après, vous devrez traduire seulement les segments modifiés.

source: There should not be missing timestamps.
fr_fr: Il ne devrait pas y avoir des données manquantes.

source: These equations were derived in Prats & Danis (2019).
fr_fr: Ces équations ont été obtenues par Prats & Danis (2019).

source: These values are the result of the parameterisation as a function of lake characteristics (latitude, altitude, maximum depth, surface area, volume) proposed by Prats & Danis (2019).
fr_fr: Ces valeurs sont le résultat de la paramétrisation en fonction des caractéristiques des lacs (latitude, altitude, profondeur maximale, aire de surface, volume) proposée par Prats & Danis (2019).

source: They contain the translatable text broken down into segments.
fr_fr: Ils contiennent le texte traduisible coupé en segments.

source: This command creates the ``okplm`` repertory in the folder ``pathtoprojectsfolder``.
fr_fr: Cette commande crée le répertoire ``okplm`` dans le dossier ``pathtoprojectsfolder``.

source: This function fits a sinusoidal function of the form:
fr_fr: Cette fonction cale une fonction sinusoïdale du type :

source: This module contains functions for time operations (e.g., time averaging or selection of date ranges).
fr_fr: Ce module contient fonctions pour des opérations temporelles (p. ex., calcul de la moyenne sur une période ou sélection de rangs de dates).

source: This module contains only one function, used to validate simulation results:
fr_fr: Ce module contient uniquement une fonction, utilisée pour valider les résultats de simulation :

source: This module contains the definition of the functions used to estimate the value of the parameters used by the OKP lake model.
fr_fr: Ce module contient les définitions des fonctions utilisées pour estimer la valeur des paramètres utilisés par le modèle de lacs OKP.

source: This module contains the following functions:
fr_fr: Ce module contient les fonctions suivantes :

source: This module contains the functions used to calculate epilimnion and hypolimnion temperature corresponding to the OKP model, described in Prats & Danis (2019).
fr_fr: Ce module contient les fonctions utilisées pour calculer la température de l'épilimnion et de l'hypolimnion d'après le modèle OKP, décrit dans Prats & Danis (2019).

source: This module defines the constants of the equations used to estimate the parameter values of the model OKP as a function of water body characteristics.
fr_fr: Ce module définit les constantes des équations utilisées pour estimer les valeurs des paramètres du modèle OKP en fonction des caractéristiques des plans d'eau.

source: This parameterisation was derived by analysing data from the French national measuring networks set up for the application of the European Water Framework Directive for 414 French water bodies with surface area larger than 0.06 km\ :sup:`2`\ .
fr_fr: Cette paramétrisation a été obtenue après analyse de données des réseaux nationaux de mesure établis pour l'application de la Directive Cadre de l'Eau pour 414 plans d'eau français plus larges de 0,06 km\ :sup:`2`\ .

source: This section describes the process to translate the `User and Developer Guide` by using pot and po files and the package ``sphinx-intl``.
fr_fr: Cette section décrit le procès pour traduire le `Guide d'Utilisation et Développement`, qui utilise des fichiers pot et po et le package ``sphinx-intl``.

source: Three of the cases are used to exemplify the usage of ``okplm`` for three different periodicities.
fr_fr: Trois tests peuvent être réalisés avec ``test_script.py`` pour illustrer l’utilisation de ``okplm`` pour trois différentes fréquences.

source: Thus to translate the text you need to edit the po files and type de translated text beside msgstr:
fr_fr: Ainsi pour traduire le texte vous devez éditer les fichiers po et taper le texte traduit à côté msgstr :

source: Thus, the model parameters are calculated from lake characteristics given in ``lake.txt`` with the following command:
fr_fr: Par conséquent, les paramètres du modèle sont calculés à partir des caractéristiques du lac dans ``lake.txt`` avec la formulation suivante :

source: To apply the changes to the po files, do
fr_fr: Pour appliquer les changements aux fichiers po, faites

source: To calculate water temperatures with ``okplm`` the values of a series of parameters need to be defined.
fr_fr: Pour calculer la température de l'eau avec ``okplm`` il faut définir les valeurs d'une série de paramètres.

source: To compile pdf documents (only in Linux), you will also need to have installed latex and the Python package ``latexmk``.
fr_fr: Pour compiler documents pdf (seulement sous Linux), il vous faudra installer aussi latex et le paquet Python ``latexmk``.

source: To compile the pdf documentation, type the following commands:
fr_fr: Pour compiler la documentation en pdf, tapez les commandes suivantes :

source: To compile the user manual as html files go to the folder ``pathtorepertoryokplm/sphinx-doc`` and type:
fr_fr: Pour compiler le manuel d'utilisation en html allez au dossier ``pathtorepertoryokplm/sphinx-doc`` et tapez :

source: To compile the user manual in English as html files go to the folder ``pathtorepertoryokplm/sphinx-doc`` and type:
fr_fr: Pour compiler le manuel d'utilisation en anglais en html allez au dossier ``pathtorepertoryokplm/sphinx-doc`` et tapez :

source: To compile the user manual in French as html files go to the folder ``pathtorepertoryokplm/sphinx-doc`` and type:
fr_fr: Pour compiler le manuel d'utilisation en français en html allez au dossier ``pathtorepertoryokplm/sphinx-doc`` et tapez :

source: To create multilingual documentation, you will need the package ``sphinx-intl``.
fr_fr: Pour créer documentation multilingue, vous avez besoin du paquet ``sphinx-intl``.

source: To extract the document's translatable messages into pot files, change to the ``sphinx-doc`` directory in the terminal and do:
fr_fr: Pour extraire les messages traduisibles du document vers des fichiers pot, placez-vous dans le dossier ``sphinx-doc`` dans le terminal et faites :

source: To install ``okplm``, go to the repertory created during the cloning of the package ``okplm`` (e.g., ``pathtorepertoryokplm``) and install it using ``pip``:
fr_fr: Pour installer ``okplm``, allez dans le répertoire créé lors du clonage du paquet ``okplm (p. ex., ``pathtorepertoryokplm``) et installez-le en utilisant ``pip``:

source: To install ``sphinx`` just make:
fr_fr: Pour installer ``sphinx`` simplement faites

source: To install latex, type:
fr_fr: Pour installer latex, tapez :
